from decouple import config
openai_api_key = config("OPENAI_API_KEY")

#-----------------конфігуруємо ботів-----------------
BOTS = [
    {
        "api_id": config("api_id1"),# api_id1, api_hash1, session1 - прописуємо у .env файлі
        "api_hash": config("api_hash1"),
        "session_string": config("session1"),
        "telegramID": 8147713326,
        "name": "Олег",
        "group_personas": {
            -1002433658675: "Ти експерт у криптовалюті. Відповідаєш на запитання дуже професійно.",
            -4646106216: "Ти не спортсмен. Ти захоплюєшся футболом і часто про нього спілкуєшся. Ти не балакучий та не жартуєш."
        },
        "chat_ids": [-1002433658675, -4646106216],  # Групи, де працює цей бот
        "delay": 10  # Затримка перед відповіддю (в секундах)
    },
    {
        "api_id": config("api_id2"),
        "api_hash": config("api_hash2"),
        "session_string": config("session2"),
        "telegramID": 7687601893,
        "name": "Катя",
        "group_personas": {
            -1002433658675: f"Ти трейдер на біржі bybit. Ти балакуча і задаєш та відповідаєш на запитання."
                            f"Відповідай лаконічно, без зайвої води 📝. Якщо можна - інколи жартуй",
            -4646106216: "Ти досвідчена спортсменка у наступних видах спорту: плавання, стрільба із лука, настільний теніс."
                         "Ти балакуча, жатрівлива та енергійна."
        },
        "chat_ids": [-1002433658675, -4646106216] , # Групи, де працює цей бот
        "delay": 20  # Затримка перед відповіддю (в секундах)
    },
    {
        "api_id": config("api_id3"),
        "api_hash": config("api_hash3"),
        "session_string": config("session3"),
        "telegramID": 7576170251,
        "name": "Люба",
        "group_personas": {
            -1002433658675: f"Ти навачок у криптовалюті, але дуже хочеш у ній розібратися. Ти не балакуча і задаєш багато коротких питань. "
                            f"Ставиш смайлики у тексті. Твої питання енергійні та зацікавлені 🤔. ",
            -4646106216: "Ти молода спортсменка. Займаєшся плаванням. Тобі цікаві різні види спорту. Ти не балакуча і задаєш багато коротких питань. "
                         "Ставиш різні смайлики у тексті. Запитання ставиш швидко, ніби поспішаєш дізнатися більше 🏃‍♂️. "
                         "Також інколи згадуєш що ти навчаєшся у школі та спортивній школі."
        },
        "chat_ids": [-1002433658675, -4646106216],  # Групи, де працює цей бот
        "delay": 3  # Затримка перед відповіддю (в секундах)
    },
]
#----------------довжина контексту----------------------

CONTEXT_LEN = 3 # це скільки попередніх повідомлень із групи передається в промпті кожного разу
# чим більше тим боти краще розуміють тему та контекст розмови, але дорожче по токенах

#-----------------конфігуруємо групи-----------------
GROUP_CONFIG = {
    -1002433658675: {"topic": "Криптовалюта"},# ключ це ID групи, Topic - промпт теми
    -4646106216: {"topic": "Спорт"},
    #-4000000000: {"topic": "Арбітраж трафіку"}, # Приклад як додати нову групу
}


